["[18/5/2023][11:35]\tpossibilidades na música estão surgindo e estou mais pedido do que nunca... São tantos projetos e pelo visto agora sim vai começar a entrar uma grana. tenho possibilidades de bolsas de estudo no IF, projetos de Pesquisa, Projetos musicais e até intercâmbio (fora os estágios remunerados). Por outro lado, na música, as músicas ds pala Rec vão lançar e logo menos a rapazeada vai estar lançada no mundão. Lua, Raquel Canta Lua, Gabriela Viegas, tenho pelo menos três projetos com cada, e foi combinado 1000 reais por música, dividos pra mim e Caio, fora se eu for entrar na lei Aldir Blanc, que é mais uma grana no meu bolso e meus próprios projetos/músicas... Qualquer um dos lados pode dar muito bom, e o ideal seria eu fazer os dois... vai ser incrivelmente difícil, precisaria de ferramentas pra gerenciar as responsabilidades. Por ventura, tenho um projeto de aplicativo com Gabriel que trata justamente isso... eu poderia programar mais um aplicativo, ele disse que seria encarregado de fazer o marketing e esse app seria pago, ou seja, mais grana no meu bolso... Pra isso, tenho mais uma coisa pra aprender (Desenvolvimento Mobile). No meio disso tudo, tem outros projetos soltos... tem realmente muita coisa pra fazer (MUITA Coisa), e eu sei que consigo manejar tudo (ou pelo menos a maioria dessas coisas)... O que eu acho: Tenho que fazer o app de Gabriel primeiro, pois ele seria uma forma de me auxiliar com todos esses objetivos.","[18/5/2023][15:23]\tteste","[18/5/2023][20:46]\thoje me dei algumas horas a mais de cama pra levantar, pois minha aula era às 9:25. Já às 9:25, após tomar banho, tomar café, etc... em cima da hora, estava pronto pra sair e me deparei com uma surpresa: Mãe tinha ido pro trabalho dela com a moto, e eu estava a pé. Pai se dispôs a me dar uma carona, que dado o meu horário, era irrecusável. No geral, o dia foi bem fora do proposto/esperado, acabei ficando numa apresentação perto da biblioteca e cantei algumas músicas, me enturmei mais. Deu o horário da aula de tarde, fui e saí agora às 17h. Decidi voltar pra casa a pé, mas meus passos estão lentos demais. Durante o percurso, entro em estado de introspecção, me torturando sobre coisas do passado, que consegui ignorar. Claramente, quando não estitu fazendo nenhuma atividade, meu subconsciente tende a mr torturar psicologicamente, como se gostasse disso... e acho que isso diz muito também sobre o fato de eu ter decidido voltar a pé... Não me importo de caminhar, porém com essa ação, de alguma forma, eu espero que mãe se sinta mal de ter feito isso... na metade do caminho eu me dei conta de que essas ações não afetam em nada o psicológico dela, e eu acabei fazendo essa 'birra' à toa...","[21/5/2023][12:43]\tnão é como se meus pensamentos extremamente intrusivos parassem, mas eles não estão mais me afetando tanto quanto antes... sempre que percebo que estou focando demais neles, tendo arrumar um jeito de me falar que 'tá tudo bem' e está funcionando. Ontem tive uma conversa com minha mãe sobre o futuro, como eu não tenho intenção de ter rios de dinheiro nem nada, só quero não estar vivendo mal, ela concordou com essa perspectiva e disse que a filosofia dela é bem parecida e que pra ela as coisas só foram vindo: casas, bens, itens, dinheiro, estabilidade, ela não chegou a almejar essas coisas e elas 'vieram' pra ela. Acho isso muito daora pois cresci vendo a gente melhorando de vida gradativamente e sou muito grato por isso, embora não demonstrar. Enfim, disse pra ela que enquanto estava voltando pra casa de pé meus pensamentos instrusivos ficaram muito mais altos, disse que de certo modo tem um vazio dentro de mim e que tenho muita preguiça de viver, só estou seguindo por inércia e porque tentar me matar não compensa e ela reforça ainda mais a ideia de religião, de que esse vazio que eu sinto é a falta de Deus na minha vida e que só acreditar não é o suficiente, que quando eu aceitar vou ser incrívelmente mais feliz... acho que essa é a parcela de ignorância que me falta pra ser menos crítico com a vida e, talvez, ser mais feliz","[22/5/2023][12:45]\tmais outro teste","[22/5/2023][13:50]\tontem fui gravar uma música de Lua com Caio Bastos, mas não consegui pegar direito o ritmo que era pra fazer... Caio também estava doente, talvez uma virose ou situsite, não sei. Só sei que em determinado ponto da produção, não saía da minha cabeça algumas coisas que eu tinha estudado antes da sessão sobre desenvolvimento mobile (React Native). Ainda teve o fator agravante de eu não conseguir fazer o beat da forma certa, eu estar levemente perdido ali, mas algo foi inédito: Recebi alguns gatilhos mas não dispararam aquele modo indefeso que eu normalmente tenho quando chapo, então com certeza estou fazendo um progresso muito bom. Em determinado ponto, após muitas horas de produção, reconheci que já estava no meu teto, exportei o projeto, mandei pra galera, arrumei minhas coisas e fui. Lua pediu pra eu buscar uma blusa de Flávia na casa da namorada dela, e eu fui lá, mas estava de moto e ela estavam de bike, então fui na frente. O foda é que eu não sabia onde era a casa de Carla (namorada de Lua), só me passaram um ponto de referencia e a rua, e eu fui. Quando finalmente achei a casa, elas estavam na frente e lua me lança um \"por que você simplesmente não veio com a gente?\" e eu fiquei em silêncio... Por ter ficado em silêncio, eu teria altas conversas introspectivas sobre o porque de eu não ter dito nada, ou o que eu poderia ter falado, mas estou calmo... calmo até demais kkkkkkkk, mas longe de mim reclamar. Já hoje foi um dia até que produtivo. Acordei bem, estudei (e nem fui pra escola, não estou tendo aula na segunda até arrumarem um professor substituto pra EDII), lavei a moto, comprei um novo curso de Desenvolvimento mobile, fiz algumas atualizações no app do whatsapp, fiz almoço com meu pai, conversamos um pouco, me sinto alegre"]